app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
---
	def index
    	@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? ORDER BY "books"."created_at" DESC LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
	def show
		@book = Book.find(params[:id])

INSERT INTO "books" ("title", "year", "isbn", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ddd"], ["year", "dee"], ["isbn", "ffff"], ["created_at", "2018-03-10 01:53:12.997812"], ["updated_at", "2018-03-10 01:53:12.997812"]]
---
	def create
		@book = Book.new(book_params)
		@book.user = current_user
		if @book.save

SELECT "books".* FROM "books" WHERE (title LIKE '%abc%' or author LIKE '%abc%' or isbn LIKE '%abc%') ORDER BY "books"."created_at" DESC
---
	def search
		if params[:query].blank?
			redirect_to root_path
		else
			@q = "%#{params[:query]}%"
			@books = Book.where("title LIKE ? or author LIKE ? or isbn LIKE ?", @q, @q, @q)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? ORDER BY "books"."created_at" DESC LIMIT ?  [["id", 96], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 93]]
---
	def destroy
		@book = Book.find(params[:id])
	        @book.destroy

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 94], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "SumervilleNew Edited"], ["updated_at", "2018-03-29 03:15:48.980164"], ["id", 94]]
---
	def update
		@book = Book.find(params[:id])
		if @book.update_attributes(book_params)