app/controllers/users_controller.rb

  def show
    @user = User.find(params["id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def create

    @user = User.new(user_params)
=begin
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)